# Useful APIs of pandas

@author glin

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# mapping between sql and pandas
# https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html
# https://medium.com/jbennetcodes/how-to-rewrite-your-sql-queries-in-pandas-and-more-149d341fc53e

In [367]:
# create dataframe
df = pd.DataFrame([['1','2',np.NaN], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', 9,'3']], columns = ['a','b','c'])
df

     a  b    c
0    1  2  NaN
1    3  4    6
2  NaN  5  NaN
3    1  9    3

In [368]:
# group by a and count number of rows of all columns except 'a' 
# even if they are duplicate
# only for non-NaN 
df.groupby('a').count()

   b  c
a
1  2  1
3  1  1

In [ ]:
# group by a and count number of rows for 'a' 
# even if they are duplicate
# NaN not counted (same as sql)
df.groupby('a').size()

In [ ]:
# group by a and count number of rows for 'a'
# NaN not counted (same as sql)
df.a.value_counts()

In [ ]:
# count distinct a, NaN not counted (same as sql)
df.a.value_counts().count()

In [ ]:
# count distinct a, NaN not counted (same as sql)
df.groupby('a').size().count()

In [ ]:
# count distinct a, NaN counted
len(df.a.unique())

In [548]:
# groupby, value_counts etc. automatically sorts values in ascending order
# when I want the last severl items of descending order, I can simply use .tail()
df.a.value_counts().tail()

1    2
3    1
Name: a, dtype: int64

###############

In [ ]:
# convert series to dataframe
s = pd.Series(['1', '2'])
s

In [ ]:
# count(), sum() are both regarding series
s.count()

In [ ]:
df1 = pd.DataFrame(s, columns = ['a'])
df1

In [ ]:
df1 = s.to_frame('a')
df1

In [ ]:
# convert string to float
df1.a = df1.a.astype(float)

In [ ]:
# check type
type(df1.a)

In [ ]:
df1.a.dtype

In [ ]:
# convert string with $ to float
dollarizer = lambda x: float(x[1:-1])
df = pd.DataFrame([['@1.2','2'], ['$3.1', '4']], columns = ['a','b'])
df = df.a.apply(dollarizer)
df

In [ ]:
# groupby a column and then sum, this will sum the rows of all columns
# if the values are string, the sum will concat string
df.groupby('a').sum()

In [ ]:
# sum() does not like different data types, it does not return that column if different types exist in that column

In [ ]:
# sort
df.sort_values(['b'], ascending=False)

In [ ]:
# groupby sorts in asc order automatically
df.groupby(['c','a']).count()

In [ ]:
# the above equals to this
df.groupby(['c','a']).count().sort_values(['c', 'a'], ascending=[True, True])

In [ ]:
df.groupby(['c','a']).size()

In [ ]:
# after groupby on multiple columns, reset_index() adds the index that are empty
df.groupby(['c','a']).size().reset_index()

In [ ]:
df.groupby(['c','a']).size().to_frame('size').reset_index()

In [ ]:
df.groupby(['c','a']).size().to_frame('size').reset_index().sort_values(['c', 'size'], ascending=[True, True])

 
 
##############

In [369]:
# create dataframe
df = pd.DataFrame([['1','2',np.NaN], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', 9,'3']], columns = ['a','b','c'])
df

     a  b    c
0    1  2  NaN
1    3  4    6
2  NaN  5  NaN
3    1  9    3

In [ ]:
# select where condition
# filter by value
df[df['b'] == '2']

In [ ]:
df[[True, False, False, False]]

In [ ]:
# use in clause
df[df['b'].isin(['2','5'])]

In [ ]:
# use not in clause
df[~df['b'].isin(['2','5'])]

In [ ]:
df['b'].isin(['2','5'])

In [ ]:
df['a']=='1'

In [ ]:
df['b'].isin(['2','5']) & df['a']=='1'

In [ ]:
# Have to use () when using &
(df['b'].isin(['2','5'])) & (df['a']=='1')

In [ ]:
# sort
df.b.sort_values(ascending=False)

In [ ]:
# sum specific columns
df.groupby('a')['b'].sum(axis = 1, skipna = True)

In [ ]:
df.groupby('a')['b'].sum()

In [370]:
# is null
df[df['b'].isna()]

Empty DataFrame
Columns: [a, b, c]
Index: []

In [371]:
# not null
df[df['b'].notna()]

     a  b    c
0    1  2  NaN
1    3  4    6
2  NaN  5  NaN
3    1  9    3

##############

In [ ]:
# create dataframe
df = pd.DataFrame([['1','2','6'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','3']], columns = ['a','b','c'])
df

In [ ]:
df.groupby(['c','a']).size().to_frame('size').reset_index()

In [ ]:
df.groupby(['c','a']).size().to_frame('size').reset_index()

In [ ]:
# group by a having count(*) > 1
df.groupby('a').filter(lambda g: len(g) > 1).groupby('a')#.size()#.sort_values(ascending=False)

In [ ]:
# select count(*) from df group by a having count(*) > 0 order by count(*)
df.groupby('a').filter(lambda g: len(g) > 0).groupby('a').size().sort_values(ascending=False)

###########

In [510]:
# create dataframe
df = pd.DataFrame([['1','2','6'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','3']], columns = ['a','b','c'])
df = df.astype(float)
df

     a    b    c
0  1.0  2.0  6.0
1  3.0  4.0  6.0
2  NaN  5.0  NaN
3  1.0  9.0  3.0

In [ ]:
# agg
df.agg({'b': ['min', 'max', 'mean', 'median']})

In [ ]:
df.agg({'b': ['min', 'max', 'mean', 'median']}).T

In [ ]:
df1 = df

In [ ]:
# union in sql
pd.concat([df[df.b == 2][['a', 'b']], df1[df1.b == 5][['a', 'b']]])

In [ ]:
pd.concat([df['a'],df1['a']])

In [ ]:
df2 = pd.concat([df,df1])
df2.reset_index(drop=True)

In [ ]:
# update
# df.loc[row, column] = value
df2.loc[df2['c'] == 3.0, 'b'] = 10

In [ ]:
# all rows
df2['b'] = 10

In [ ]:
# delete rows
# drop a part of dataframe that match a condition
df2.drop(df2[df2.c == 3].index).reset_index()

In [ ]:
# add a column
df2['d'] = 8

In [ ]:
# delete columns
df2.drop('d', axis=1, inplace=True)

In [ ]:
df2

In [ ]:
df2.agg({'a':['mean']})

In [511]:
# axis = 0, operate along x axis (vertical), meaning along all rows for any single column
df2.mean(axis=0)

a    1.666667
b    5.000000
c    5.000000
dtype: float64

In [515]:
# axis = 0, operate along x axis (vertical), meaning along all rows for any single column
df['a'].mean(axis=0)

1.6666666666666667

In [ ]:
# axis = 0, operate along x axis (vertical), meaning along all rows for any single column
df2.loc[:,'a'].mean(axis=0)

In [ ]:
# axis = 1, operate along y axis (horizontal), meaning along all columns for any single row
df2.loc[1, :].mean(axis=1)

In [512]:
# axis = 1, operate along y axis (horizontal), meaning along all columns for any single row
df2.mean(axis=1)

0    3.000000
1    4.333333
2    5.000000
3    4.333333
0    3.000000
1    4.333333
2    5.000000
3    4.333333
dtype: float64

######################

In [525]:
# create dataframe
df = pd.DataFrame([['1','2','6'], ['3', '4','6'], [np.NaN, '5',np.NaN], ['1', '9','6']], columns = ['a','b','c'])
df

     a  b    c
0    1  2    6
1    3  4    6
2  NaN  5  NaN
3    1  9    6

In [383]:
# random sample
df.sample(n=2)

   a  b  c
1  3  4  6
0  1  2  6

In [388]:
df.sample(frac=0.5)

     a  b    c
0    1  2    6
2  NaN  5  NaN

In [486]:
# sample with weights
weights = [0.1, 0.1, 0.1, 0.7]

In [502]:
df.sample(n = 2, weights = weights)

     a  b    c
3    1  9    3
2  NaN  5  NaN

In [508]:
# drop duplicates
df.drop_duplicates('c')

     a  b    c
0    1  2    6
2  NaN  5  NaN

In [509]:
# drop duplicates based on a tuple of columns
df.drop_duplicates(['c','a'])

     a  b    c
0    1  2    6
1    3  4    6
2  NaN  5  NaN

In [531]:
# use a column as index
df.set_index('a', inplace=True)

In [533]:
# reset index to drop the role of the column used as index
df.reset_index()

     a  b    c
0    1  2    6
1    3  4    6
2  NaN  5  NaN
3    1  9    6

In [541]:
# reset index to drop the role of the column used as index
# remember to re-assign!
df = df.reset_index()

######################

In [534]:
# check data type of all columns
df.dtypes

b    object
c    object
dtype: object

In [544]:
# describe, By default, only the numeric columns are returned.
df.a.describe()

count     3
unique    2
top       1
freq      2
Name: a, dtype: object

In [543]:
df.describe()

        a  b  c
count   3  4  3
unique  2  4  1
top     1  5  6
freq    2  1  3

In [545]:
# include all columns
df.describe(include = 'all')

        a  b  c
count   3  4  3
unique  2  4  1
top     1  5  6
freq    2  1  3